# READING TABULAR DATA

## Import pandas library

For example, say we are working with data regarding the names of babies born in the United States and this data is stored in a CSV file called US baby names.csv. To access the data we can read in the file bellow. The first thing we will be going to do is import the pandas library. And we will do this by writing the keyword import, followed by pandas. And we'll also add in as pd. Now this means that going forward in this notebook we need to use pd to refer to pandas.

In [2]:
# Import pandas library
import pandas as pd

## Import data from a csv file

And now I want to read in a CSV file called US baby names.csv that I have stored in the data directory . So I'm going to use the read CSV method from the pandas library to do that. So I'll type in pd.read_csv, parentheses, and now I'm going to type in the name of the CSV file as a string. Quote, us baby names.csv. And I'll go ahead and run the cell. And now you can see the data. And this object here is called a pandas DataFrame. Now I can create a variable called us babies and assign it to this DataFrame,

In [ ]:
us_babies = pd.read_csv('Data/us_baby_names.csv')

To see the data again all I have to do is type in us babies into this cell and run.

In [ ]:
us_babies
# As you can see, the columns are labeled ID, Name, Year, 
# Gender, and Count. And the rows are labeled zero, one, two, 
# all the way to 1,825,433. Note that Gender in this data set 
# refers to the gender assigned to these babies at birth.

## What were the five most popular baby names in 2014 in the US?

We will approche this in stages. First We'll , slice out the rows fot the year 2014 then we'll sort the rows in descending order by count. After that we'll get the first five rows of the resulting DataFrame. And now we'll show you how to do this using the pandas library

### Step 1: Slice out the rows for the year 2014

First, I'll show you how to access the Year column from the us babies DataFrame. And I do this by writing us babies, square brackets, Year. Note that the name of a column is always expressed as a string. I'll go ahead and run the cell

In [ ]:
us_babies['Year']

This output object is called a pandas serie

### Step 2: We need to select rows where the year is equal to 2014.

In [ ]:
us_babies['Year']==2014

We create a Series that contains true for each row I want to keep and false for each row I want to drop.
I do this by comparing each year in us babies with 2014.  
There. As you can see, each year from the Year column was compared to 2014 and I got a series of true and false. 
Just a note, these true and false values are known as booleans in programming.

Now I want to use loc. Loc is a method that allows you to access a specific group of rows and columns from a pandas DataFrame. Loc can take in a series of booleans, such as the one I just created, as an input. So I'll pass in this series of booleans as a first input to loc and then the second input will be a colon. I'll type in us babies.loc, square brackets, us babies, square brackets, Year, equals equals 2014 comma colon. Now this part means that I want to access only the rows where the Year is 2014. And the colon here denotes that I want to access all the columns for the rows where Year is 2014.

In [ ]:
us_babies.loc[us_babies['Year']==2014,:]

Now I'll create a variable named us babies 2014 and assign it to this DataFrame and I'll run the cell. So now I can use us babies 2014 to access the DataFrame I just created.

In [ ]:
us_babies_2014 = us_babies.loc[us_babies['Year']==2014,:]

### Step 3: sort the rows in descending order by count

To do this I'll use the sort values method. I'll pass in count as a first input and descending equals false as a second input. And that second input is what allows me to sort in descending order. So I'll type in us babies 2014.sort values, parentheses, Count comma ascending equals false.

In [ ]:
us_babies_2014.sort_values('Count',ascending=False)

And I got a new DataFrame. That's because the method sort values returns a new DataFrame.

Now it'll be convenient to store this new DataFrame in a variable, so that I can refer to the variable whenever I want to access the DataFrame. So I'll go ahead and create a variable, I'll call it sorted us 2014, and I'll assign it to this DataFrame. And I'll run the cell.

In [ ]:
sorted_us_2014 = us_babies_2014.sort_values('Count',ascending=False)

So now when I type in sorted us 2014 and run the cell I have access to the sorted DataFrame.

In [ ]:
sorted_us_2014

### Step 4: slice out the first five rows of sorted us 2014

Iloc is the method that works similarly to loc, but takes in numerical indexes instead of the names of columns as inputs. So I'll go ahead and type in sorted us 2014.iloc, square brackets, 0:5. And I'll run the cell. There. So as you can see, the notation 0:5 allows me to access the first five rows of the sorted us 2014 DataFrame

In [ ]:
sorted_us_2014.iloc[0:5]

And according to the data set I'm working with Emma, Olivia, Noah, Sophia, and Liam are the five most popular baby names in 2014 in the United States.

So I have a CSV file named state baby names.csv located in the data directory. And to read in that CSV file I'll use the method read CSV from the pandas library. So pd.read csv, parentheses, state baby names.csv. And the read CSV method will convert the CSV file into a pandas DataFrame, which I'll go ahead and store in a variable named states babies. And I'll run the cell.

In [3]:
states_babies = pd.read_csv('Data/state_baby_names.csv')

Now when I type in states babies in this cell and run it I have access to the DataFrame. Notice that each row in this DataFrame represents a distinct pair of baby name, birth year, and birth state.

In [4]:
states_babies

              Id      Name  Year Gender State  Count
0              1      Mary  1910      F    AK     14
1              2     Annie  1910      F    AK     12
2              3      Anna  1910      F    AK     10
3              4  Margaret  1910      F    AK      8
4              5     Helen  1910      F    AK      7
...          ...       ...   ...    ...   ...    ...
5647421  5647422      Seth  2014      M    WY      5
5647422  5647423   Spencer  2014      M    WY      5
5647423  5647424      Tyce  2014      M    WY      5
5647424  5647425    Victor  2014      M    WY      5
5647425  5647426    Waylon  2014      M    WY      5

[5647426 rows x 6 columns]

Now let's use pandas and the states babies data set to answer the following question.

## What were the five most popular baby names in 2014 in California?

Again, I'll approach this in stages. First, I'll slice out the rows for the year 2014. Next, I'll slice out the rows for the state California. Then I'll sort the rows in descending order by Count. After that I'll get the first five rows of the resulting DataFrame. Now I'll show you how to do this using the pandas library.

### Step 1: Slice out the rows for the year 2014

So I'll use the loc method. I'll go ahead and type in states babies.loc, square brackets, states babies, square brackets, Year, equals equals 2014 comma colon. Now the first input indicates that I want only the rows of the states babies DataFrame that correspond to names of babies born in various states in the year 2014. The second input indicates that I want all columns for the aforementioned rows. And since the loc method returns a new DataFrame I'll go ahead and store it in a variable, which I'll name states babies 2014. And I'll run the cell.

In [5]:
statee_babies_2014 = states_babies.loc[states_babies['Year']==2014,:]

Now I'll type states babies 2014 and run.

In [6]:
statee_babies_2014

              Id      Name  Year Gender State  Count
13522      13523      Emma  2014      F    AK     50
13523      13524    Olivia  2014      F    AK     47
13524      13525    Sophia  2014      F    AK     43
13525      13526    Aurora  2014      F    AK     35
13526      13527  Isabella  2014      F    AK     33
...          ...       ...   ...    ...   ...    ...
5647421  5647422      Seth  2014      M    WY      5
5647422  5647423   Spencer  2014      M    WY      5
5647423  5647424      Tyce  2014      M    WY      5
5647424  5647425    Victor  2014      M    WY      5
5647425  5647426    Waylon  2014      M    WY      5

[94148 rows x 6 columns]

### Step 2: Slice out rows for the state California

Next, I want to slice out the rows of the states babies 2014 DataFrame to correspond to the state California. To do this I'll use the loc method again. So I'll type in states babies 2014.loc, square brackets, states babies 2014, square brackets, State, equals equals CA, which represents California, comma colon. And I'll go ahead and store this in a variable named ca babies 2014. And I'll run the cell.

In [8]:
ca_babies_2014=statee_babies_2014.loc[statee_babies_2014['State']=='CA',:]

Now when I type in ca babies 2014 I have access to that DataFrame.

In [9]:
ca_babies_2014

            Id      Name  Year Gender State  Count
561495  561496    Sophia  2014      F    CA   3162
561496  561497  Isabella  2014      F    CA   2705
561497  561498      Emma  2014      F    CA   2662
561498  561499       Mia  2014      F    CA   2627
561499  561500    Olivia  2014      F    CA   2407
...        ...       ...   ...    ...   ...    ...
710225  710226    Zakary  2014      M    CA      5
710226  710227   Zealand  2014      M    CA      5
710227  710228      Ziad  2014      M    CA      5
710228  710229    Zidane  2014      M    CA      5
710229  710230     Ziyad  2014      M    CA      5

[6903 rows x 6 columns]

### Step 3: Sort the rows of the ca babies 2014 DataFrame in descending order by Count

To do this I'll use the sort values method again. So I'll type in ca babies 2014.sort values, parentheses, Count comma ascending equals False. And I'll go ahead and store that DataFrame in a variable named sorted_ca_2014. And I'll run the cell.

In [10]:
sorted_ca_2014 = ca_babies_2014.sort_values('Count',ascending=False)

Now when I type in sorted ca 2014 I have access to that DataFrame.

In [11]:
sorted_ca_2014

            Id      Name  Year Gender State  Count
561495  561496    Sophia  2014      F    CA   3162
707311  707312      Noah  2014      M    CA   2761
561496  561497  Isabella  2014      F    CA   2705
707312  707313     Jacob  2014      M    CA   2692
561497  561498      Emma  2014      F    CA   2662
...        ...       ...   ...    ...   ...    ...
565293  565294    Marvel  2014      F    CA      5
565294  565295     Masyn  2014      F    CA      5
565295  565296  Mathilda  2014      F    CA      5
565296  565297    Mattea  2014      F    CA      5
710229  710230     Ziyad  2014      M    CA      5

[6903 rows x 6 columns]

### Step 4: slice out the first five rows of sorted ca 2014

To do this I'll use the iloc method again. So I'll type in sorted ca 2014, square brackets, 0:5. And I'll run the cell.

In [12]:
sorted_ca_2014.iloc[0:5]

            Id      Name  Year Gender State  Count
561495  561496    Sophia  2014      F    CA   3162
707311  707312      Noah  2014      M    CA   2761
561496  561497  Isabella  2014      F    CA   2705
707312  707313     Jacob  2014      M    CA   2692
561497  561498      Emma  2014      F    CA   2662

There we go. So according to this data set Sophia, Noah, Isabella, Jacob, and Emma are the five most popular baby names in 2014 in California.